espressif/idf-eclipse-plugin/bundles/com.espressif.idf.debug.gdbjtag.openocd/svd/esp32s3-ulp.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SENS</name>
      <description>SENS Peripheral</description>
      <groupName>SENS</groupName>
      <baseAddress>0x0000C800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x11C</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>TOUCH_DONE_INT</name>
        <value>0</value>
      </interrupt>
      <interrupt>
        <name>TOUCH_INACTIVE_INT</name>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>TOUCH_ACTIVE_INT</name>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>SARADC1_DONE_INT</name>
        <value>3</value>
      </interrupt>
      <interrupt>
        <name>SARADC2_DONE_INT</name>
        <value>4</value>
      </interrupt>
      <interrupt>
        <name>TSENS_DONE_INT</name>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>TOUCH_TIME_OUT_INT</name>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>TOUCH_APPROACH_LOOP_DONE_INT</name>
        <value>10</value>
      </interrupt>
      <interrupt>
        <name>TOUCH_SCAN_DONE_INT</name>
        <value>11</value>
      </interrupt>
      <registers>
        <register>
          <name>SAR_SLAVE_ADDR1</name>
          <description>configure i2c slave address</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_I2C_SLAVE_ADDR1</name>
              <description>configure i2c slave address1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_I2C_SLAVE_ADDR0</name>
              <description>configure i2c slave address0</description>
              <bitOffset>11</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_SARADC_MEAS_STATUS</name>
              <description>no public</description>
              <bitOffset>22</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_SLAVE_ADDR2</name>
          <description>configure i2c slave address</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_I2C_SLAVE_ADDR3</name>
              <description>configure i2c slave address3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_I2C_SLAVE_ADDR2</name>
              <description>configure i2c slave address2</description>
              <bitOffset>11</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_SLAVE_ADDR3</name>
          <description>configure i2c slave address</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_I2C_SLAVE_ADDR5</name>
              <description>configure i2c slave address5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_I2C_SLAVE_ADDR4</name>
              <description>configure i2c slave address4</description>
              <bitOffset>11</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_SLAVE_ADDR4</name>
          <description>configure i2c slave address</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_I2C_SLAVE_ADDR7</name>
              <description>configure i2c slave address7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_I2C_SLAVE_ADDR6</name>
              <description>configure i2c slave address6</description>
              <bitOffset>11</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_I2C_CTRL</name>
          <description>configure rtc i2c controller by sw</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_I2C_CTRL</name>
              <description>I2C control data  only active when reg_sar_i2c_start_force = 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_I2C_START</name>
              <description>start I2C  only active when reg_sar_i2c_start_force = 1</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_I2C_START_FORCE</name>
              <description>1: I2C started by SW  0: I2C started by FSM</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_COCPU_INT_RAW</name>
          <description>the interrupt raw of ulp</description>
          <addressOffset>0xE8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_COCPU_TOUCH_DONE_INT_RAW</name>
              <description>int from touch done</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_COCPU_TOUCH_INACTIVE_INT_RAW</name>
              <description>int from touch inactive</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_COCPU_TOUCH_ACTIVE_INT_RAW</name>
              <description>int from touch active</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_COCPU_SARADC1_INT_RAW</name>
              <description>int from saradc1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_COCPU_SARADC2_INT_RAW</name>
              <description>int from saradc2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_COCPU_TSENS_INT_RAW</name>
              <description>int from tsens</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_COCPU_START_INT_RAW</name>
              <description>int from start</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_COCPU_SW_INT_RAW</name>
              <description>int from software</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_COCPU_SWD_INT_RAW</name>
              <description>int from super watch dog</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_COCPU_TOUCH_TIMEOUT_INT_RAW</name>
              <description>int from timeout done</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_COCPU_TOUCH_APPROACH_LOOP_DONE_INT_RAW</name>
              <description>int from approach loop done</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_COCPU_TOUCH_SCAN_DONE_INT_RAW</name>
              <description>int from touch scan done</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_COCPU_INT_ENA</name>
          <description>the interrupt enable of ulp</description>
          <addressOffset>0xEC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_COCPU_TOUCH_DONE_INT_ENA</name>
              <description>int enable of touch done</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_COCPU_TOUCH_INACTIVE_INT_ENA</name>
              <description>int enable of from touch inactive</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_COCPU_TOUCH_ACTIVE_INT_ENA</name>
              <description>int enable of touch active</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_COCPU_SARADC1_INT_ENA</name>
              <description>int enable of from saradc1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_COCPU_SARADC2_INT_ENA</name>
              <description>int enable of from saradc2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_COCPU_TSENS_INT_ENA</name>
              <description>int enable of tsens</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_COCPU_START_INT_ENA</name>
              <description>int enable of start</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_COCPU_SW_INT_ENA</name>
              <description>int enable of  software</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_COCPU_SWD_INT_ENA</name>
              <description>int enable of super watch dog</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_COCPU_TOUCH_TIMEOUT_INT_ENA</name>
              <description>int enable of timeout done</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_COCPU_TOUCH_APPROACH_LOOP_DONE_INT_ENA</name>
              <description>int enable of approach loop done</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_COCPU_TOUCH_SCAN_DONE_INT_ENA</name>
              <description>int enable of touch scan done</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_COCPU_INT_ST</name>
          <description>the interrupt state of ulp</description>
          <addressOffset>0xF0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_COCPU_TOUCH_DONE_INT_ST</name>
              <description>int state of touch done</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_COCPU_TOUCH_INACTIVE_INT_ST</name>
              <description>int state of from touch inactive</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_COCPU_TOUCH_ACTIVE_INT_ST</name>
              <description>int state of touch active</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_COCPU_SARADC1_INT_ST</name>
              <description>int state of from saradc1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_COCPU_SARADC2_INT_ST</name>
              <description>int state of from saradc2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_COCPU_TSENS_INT_ST</name>
              <description>int state of tsens</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_COCPU_START_INT_ST</name>
              <description>int state of start</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_COCPU_SW_INT_ST</name>
              <description>int state of  software</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_COCPU_SWD_INT_ST</name>
              <description>int state of super watch dog</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_COCPU_TOUCH_TIMEOUT_INT_ST</name>
              <description>int state of timeout done</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_COCPU_TOUCH_APPROACH_LOOP_DONE_INT_ST</name>
              <description>int state of approach loop done</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_COCPU_TOUCH_SCAN_DONE_INT_ST</name>
              <description>int state of touch scan done</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_COCPU_INT_CLR</name>
          <description>the interrupt clear of ulp</description>
          <addressOffset>0xF4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_COCPU_TOUCH_DONE_INT_CLR</name>
              <description>int clear of touch done</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SAR_COCPU_TOUCH_INACTIVE_INT_CLR</name>
              <description>int clear of from touch inactive</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SAR_COCPU_TOUCH_ACTIVE_INT_CLR</name>
              <description>int clear of touch active</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SAR_COCPU_SARADC1_INT_CLR</name>
              <description>int clear of from saradc1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SAR_COCPU_SARADC2_INT_CLR</name>
              <description>int clear of from saradc2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SAR_COCPU_TSENS_INT_CLR</name>
              <description>int clear of tsens</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SAR_COCPU_START_INT_CLR</name>
              <description>int clear of start</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SAR_COCPU_SW_INT_CLR</name>
              <description>int clear of  software</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SAR_COCPU_SWD_INT_CLR</name>
              <description>int clear of super watch dog</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SAR_COCPU_TOUCH_TIMEOUT_INT_CLR</name>
              <description>int clear of timeout done</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SAR_COCPU_TOUCH_APPROACH_LOOP_DONE_INT_CLR</name>
              <description>int clear of approach loop done</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SAR_COCPU_TOUCH_SCAN_DONE_INT_CLR</name>
              <description>int clear of touch scan done</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>